In [1]:
import pandas as pd
df=pd.read_csv('hotels.csv')
df.head()

   Sr. No.  Hotel Code        State  Cost  Ratings
0        1  TN68367619    Tamilnadu   720      4.6
1        2  MH84778017  Maharashtra   560      5.4
2        3  TN11397489    Tamilnadu  1760      9.3
3        4  MH09379534  Maharashtra   680      9.8
4        5  TN01526325    Tamilnadu   560      2.8

In [2]:
df.State.unique()

array(['Tamilnadu', 'Maharashtra', 'Karnataka'], dtype=object)

In [4]:
print("select state name")
state_name=input("aviable options are ['Tamilnadu', 'Maharashtra', 'Karnataka']")
rating_or_cost=input("select rating or cost")
print("select operation")
operation=input("aviable options are,['high','cheap','avg'] ")
m1=df['State']==state_name
state_table=df[m1]
length_of_state_table=len(state_table)
if rating_or_cost=='rating':
    if operation=='cheap':
        m2=df['Ratings'].min()
        print(m2)
    if operation=='high':
        m2=df['Ratings'].max()
        print(m2)
    if operation=='avg':
        m2=df['Ratings'].sum()
        print(m2/length_of_state_table)
if rating_or_cost=='Cost':
    if operation=='cheap':
        m2=df['Cost'].min()
        print(m2)
    if operation=='high':
        m2=df['Cost'].max()
        print(m2)
    if operation=='avg':
        m2=df['Cost'].sum()
        p=m2/length_of_state_table
        print(p)

select state name
aviable options are ['Tamilnadu', 'Maharashtra', 'Karnataka']Maharashtra
select rating or costrating
select operation
aviable options are,['high','cheap','avg'] high
10.0